In [1]:
import sqlite3
import pandas as pd

In [2]:
con = sqlite3.connect(':memory:')

In [3]:
table_names = [
    'Categories',   # –∫–∞—Ç–µ–≥–æ—Ä–∏–∏ —Ç–æ–≤–∞—Ä–æ–≤
    'Customers',    # –∑–∞–∫–∞–∑—á–∏–∫–∏
    'Employees',    # —Å–æ—Ç—Ä—É–¥–Ω–∏–∫–∏
    'OrderDetails', # –¥–µ—Ç–∞–ª–∏ –∑–∞–∫–∞–∑–æ–≤
    'Orders',       # –∑–∞–∫–∞–∑—ã
    'Products',     # —Ç–æ–≤–∞—Ä—ã
    'Shippers',     # –ø–µ—Ä–µ–≤–æ–∑—á–∏–∫–∏
    'Suppliers',    # –ø–æ—Å—Ç–∞–≤—â–∏–∫–∏
]

In [4]:
for table in table_names:
    data = pd.read_csv(f'{table}.csv', sep = ';')
    data.to_sql(table, con, index=False, if_exists='replace')

In [5]:
pd.read_sql(
    '''
    SELECT * FROM Categories
    ''',
    con,
)

,CategoryID,CategoryName,Description
0,1,Beverages,"Soft drinks, coffees, teas, beers, and ales"
1,2,Condiments,"Sweet and savory sauces, relishes, spreads, an..."
2,3,Confections,"Desserts, candies, and sweet breads"
3,4,Dairy Products,Cheeses
4,5,Grains/Cereals,"Breads, crackers, pasta, and cereal"
5,6,Meat/Poultry,Prepared meats
6,7,Produce,Dried fruit and bean curd
7,8,Seafood,Seaweed and fish

In [6]:
tasks = 0

### –í—Å–µ –∑–∞–¥–∞–Ω–∏—è –Ω—É–∂–Ω–æ –≤—ã–ø–æ–ª–Ω–∏—Ç—å —Ç–æ–ª—å–∫–æ —Å –ø–æ–º–æ—â—å—é sql

1. –í—ã–±–µ—Ä–∏—Ç–µ –∑–∞–∫–∞–∑—á–∏–∫–æ–≤ –∏–∑ –ì–µ—Ä–º–∞–Ω–∏–∏, –§—Ä–∞–Ω—Ü–∏–∏ –∏ –ú–∞–¥—Ä–∏–¥–∞, –≤—ã–≤–µ–¥–∏—Ç–µ –∏—Ö –Ω–∞–∑–≤–∞–Ω–∏–µ, —Å—Ç—Ä–∞–Ω—É –∏ –∞–¥—Ä–µ—Å.

In [7]:
tasks+=1
pd.read_sql(
    '''
    SELECT CustomerName, Country, Address  
    FROM Customers
    WHERE Country in ('Germany','France') or City = 'Madrid'
    ''',
    con,
)

,CustomerName,Country,Address
0,Alfreds Futterkiste,Germany,Obere Str. 57
1,Blauer See Delikatessen,Germany,Forsterstr. 57
2,Blondel p√®re et fils,France,"24, place Kl√©ber"
3,B√≥lido Comidas preparadas,Spain,"C/ Araquil, 67"
4,Bon app',France,"12, rue des Bouchers"
5,Drachenblut Delikatessend,Germany,Walserweg 21
6,Du monde entier,France,"67, rue des Cinquante Otages"
7,FISSA Fabrica Inter. Salchichas S.A.,Spain,"C/ Moralzarzal, 86"
8,Folies gourmandes,France,"184, chauss√©e de Tournai"
9,Frankenversand,Germany,Berliner Platz 43
10,France restauration,France,"54, rue Royale"
11,K√∂niglich Essen,Germany,Maubelstr. 90
12,La corne d'abondance,France,"67, avenue de l'Europe"
13,La maison d'Asie,France,1 rue Alsace-Lorraine
14,Lehmanns Marktstand,Germany,Magazinweg 7
15,Morgenstern Gesundkost,Germany,Heerstr. 22
16,Ottilies K√§seladen,Germany,Mehrheimerstr. 369
17,Paris sp√©cialit√©s,France,"265, boulevard Charonne"
18,QUICK-Stop,Germany,Taucherstra√üe 10
19,Romero y tomillo,Spain,"Gran V√≠a, 1"
20,Sp√©cialit√©s du monde,France,"25, rue Lauriston"
21,Toms Spezialit√§ten,Germany,Luisenstr. 48
22,Victuailles en stock,France,"2, rue du Commerce"
23,Vins et alcools Chevalier,France,59 rue de l'Abbaye
24,Die Wandernde Kuh,Germany,Adenauerallee 900

2. –í—ã–±–µ—Ä–∏—Ç–µ —Ç–æ–ø 3 —Å—Ç—Ä–∞–Ω—ã –ø–æ –∫–æ–ª–∏—á–µ—Å—Ç–≤—É –∑–∞–∫–∞–∑—á–∏–∫–æ–≤, –≤—ã–≤–µ–¥–∏—Ç–µ –∏—Ö –Ω–∞–∑–≤–∞–Ω–∏—è –∏ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –∑–∞–ø–∏—Å–µ–π.

In [8]:
tasks+=1
pd.read_sql(
    '''
    SELECT Country, count(CustomerName) as CountCustomers FROM Customers
    GROUP BY Country
    ORDER BY CountCustomers DESC
    LIMIT 3
    ''',
    con,
)

   Country  CountCustomers
0      USA              13
1  Germany              11
2   France              11

3. –í—ã–±–µ—Ä–∏—Ç–µ –ø–µ—Ä–µ–≤–æ–∑—á–∏–∫–∞, –∫–æ—Ç–æ—Ä—ã–π –æ—Ç–ø—Ä–∞–≤–∏–ª 10-–π –ø–æ –≤—Ä–µ–º–µ–Ω–∏ –∑–∞–∫–∞–∑, –≤—ã–≤–µ–¥–∏—Ç–µ –µ–≥–æ –Ω–∞–∑–≤–∞–Ω–∏–µ, –∏ –¥–∞—Ç—É –æ—Ç–ø—Ä–∞–≤–ª–µ–Ω–∏—è.

In [9]:
tasks+=1
pd.read_sql(
    '''
    SELECT ShipperName, OrderDate  
    FROM Orders
    JOIN Shippers
    on Orders.ShipperID = Shippers.ShipperID
    LIMIT 9, 1
    ''',
    con,
)

        ShipperName   OrderDate
0  Federal Shipping  16.07.1996

4. –í—ã–±–µ—Ä–∏—Ç–µ —Å–∞–º—ã–π –¥–æ—Ä–æ–≥–æ–π –∑–∞–∫–∞–∑, –≤—ã–≤–µ–¥–∏—Ç–µ —Å–ø–∏—Å–æ–∫ —Ç–æ–≤–∞—Ä–æ–≤ —Å –∏—Ö —Ü–µ–Ω–∞–º–∏.

In [10]:
tasks+=1
pd.read_sql(
    '''
    WITH OrdersDetailsJProducts AS
        (SELECT OrderID, OrderDetails.ProductID, Quantity, ProductName, Price  
        FROM OrderDetails
        JOIN Products
        on OrderDetails.ProductID = Products.ProductID
        ),
    TotalSumOrders AS (
        SELECT OrderID, SUM(Quantity * Price) as Total
        FROM OrdersDetailsJProducts
        GROUP BY OrderID
                        )
        
    SELECT OrderID, ProductName, Quantity, Price
    FROM OrdersDetailsJProducts
    WHERE OrderID=
        (SELECT OrderID 
        FROM TotalSumOrders
        WHERE Total = (
                        SELECT MAX(Total)
                        FROM TotalSumOrders
                       )
        )
    ''',
    con,
)

   OrderID             ProductName  Quantity  Price
0    10372  Sir Rodney's Marmalade        12   81.0
1    10372           C√¥te de Blaye        40  263.5
2    10372       Camembert Pierrot        70   34.0
3    10372  Mozzarella di Giovanni        42   34.8

5. –ö–∞–∫–æ–π —Ç–æ–≤–∞—Ä –±–æ–ª—å—à–µ –≤—Å–µ–≥–æ –∑–∞–∫–∞–∑—ã–≤–∞–ª–∏ –ø–æ –∫–æ–ª–∏—á–µ—Å—Ç–≤—É –µ–¥–∏–Ω–∏—Ü —Ç–æ–≤–∞—Ä–∞, –≤—ã–≤–µ–¥–∏—Ç–µ –µ–≥–æ –Ω–∞–∑–≤–∞–Ω–∏–µ –∏ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –µ–¥–∏–Ω–∏—Ü –≤ –∫–∞–∂–¥–æ–º –∏–∑ –∑–∞–∫–∞–∑–æ–≤.

In [11]:
tasks+=1
pd.read_sql(
    '''
    WITH OrdersDetailsJProducts AS(
    SELECT OrderID, OrderDetails.ProductID, Quantity, ProductName
    FROM OrderDetails
    JOIN Products
    on OrderDetails.ProductID = Products.ProductID
    ),
    TotalCountProducts AS (
    SELECT ProductID, SUM(Quantity) as TotalQuantity
    FROM OrdersDetailsJProducts
    GROUP BY ProductID
                          )
                       
    SELECT ProductName, Quantity, OrderID  
    FROM OrdersDetailsJProducts
    WHERE ProductID =(
                      SELECT ProductID
                      FROM TotalCountProducts
                      WHERE TotalQuantity = (
                                            SELECT MAX(TotalQuantity)
                                            FROM TotalCountProducts
                                            )
                      )
    ORDER BY Quantity DESC
    ''',
    con,
)

          ProductName  Quantity  OrderID
0   Gorgonzola Telino        70    10359
1   Gorgonzola Telino        60    10390
2   Gorgonzola Telino        56    10342
3   Gorgonzola Telino        42    10376
4   Gorgonzola Telino        40    10272
5   Gorgonzola Telino        32    10393
6   Gorgonzola Telino        30    10356
7   Gorgonzola Telino        30    10374
8   Gorgonzola Telino        25    10335
9   Gorgonzola Telino        20    10253
10  Gorgonzola Telino        20    10363
11  Gorgonzola Telino        15    10273
12  Gorgonzola Telino        14    10423
13  Gorgonzola Telino         4    10325

6. –í—ã–≤–µ–¥–∏—Ç–µ —Ç–æ–ø 5 –ø–æ—Å—Ç–∞–≤—â–∏–∫–æ–≤ –ø–æ –∫–æ–ª–∏—á–µ—Å—Ç–≤—É –∑–∞–∫–∞–∑–æ–≤, –≤—ã–≤–µ–¥–∏—Ç–µ –∏—Ö –Ω–∞–∑–≤–∞–Ω–∏—è, —Å—Ç—Ä–∞–Ω—É, –∫–æ–Ω—Ç–∞–∫—Ç–Ω–æ–µ –ª–∏—Ü–æ –∏ —Ç–µ–ª–µ—Ñ–æ–Ω.

In [12]:
tasks+=1
pd.read_sql(
    '''
    SELECT SupplierName, Country, ContactName, Phone
    FROM Suppliers
    WHERE SupplierID IN (
        SELECT SupplierID
        FROM OrderDetails
        JOIN Products
        on OrderDetails.ProductID = Products.ProductID
        GROUP BY SupplierID
        ORDER BY count(OrderID) DESC
        LIMIT 5
                        )
    ''',
    con,
)

                        SupplierName    Country   ContactName           Phone
0                      Pavlova, Ltd.  Australia   Ian Devling   (03) 444-2343
1           Specialty Biscuits, Ltd.         UK  Peter Wilson  (161) 555-4448
2  Plutzer Lebensmittelgro√üm√§rkte AG    Germany   Martin Bein    (069) 992755
3            Formaggi Fortini s.r.l.      Italy    Elio Rossi    (0544) 60323
4                    Norske Meierier     Norway  Beate Vileid     (0)2-953010

7. –ö–∞–∫—É—é –∫–∞—Ç–µ–≥–æ—Ä–∏—é —Ç–æ–≤–∞—Ä–æ–≤ –∑–∞–∫–∞–∑—ã–≤–∞–ª–∏ –±–æ–ª—å—à–µ –≤—Å–µ–≥–æ –ø–æ —Å—Ç–æ–∏–º–æ—Å—Ç–∏ –≤ –ë—Ä–∞–∑–∏–ª–∏–∏, –≤—ã–≤–µ–¥–∏—Ç–µ —Å—Ç—Ä–∞–Ω—É, –Ω–∞–∑–≤–∞–Ω–∏–µ –∫–∞—Ç–µ–≥–æ—Ä–∏–∏ –∏ —Å—É–º–º—É.

In [13]:
tasks+=1
pd.read_sql(
    '''
    SELECT Country, CategoryName, SUM(Quantity*Price) as Total
    FROM OrderDetails
    JOIN Orders
    ON OrderDetails.OrderID = Orders.OrderID
    JOIN Customers
    ON Orders.CustomerID = Customers.CustomerID
    JOIN Products
    ON OrderDetails.ProductID = Products.ProductID
    JOIN Categories
    ON Products.CategoryID = Categories.CategoryID
    WHERE Country = 'Brazil'
    GROUP BY CategoryName
    ORDER BY Total DESC
    LIMIT 1
    ''',
    con,
)

  Country CategoryName    Total
0  Brazil    Beverages  13690.0

8. –ö–∞–∫–∞—è —Ä–∞–∑–Ω–∏—Ü–∞ –≤ —Å—Ç–æ–∏–º–æ—Å—Ç–∏ –º–µ–∂–¥—É —Å–∞–º—ã–º –¥–æ—Ä–æ–≥–∏–º –∏ —Å–∞–º—ã–º –¥–µ—à–µ–≤—ã–º –∑–∞–∫–∞–∑–æ–º –∏–∑ –°–®–ê.

In [14]:
tasks+=1
pd.read_sql(
    '''
    WITH TotalOrdersUSA AS (SELECT SUM(Quantity*Price) as Total
    FROM OrderDetails
    JOIN Products
    ON OrderDetails.ProductID = Products.ProductID
    WHERE OrderID IN(
        SELECT OrderID
        FROM Orders
        WHERE CustomerID in (
            SELECT CustomerID 
            FROM Customers
            WHERE Country = 'USA'
                            )
                    )
    GROUP BY OrderID
    )
    SELECT MAX(Total) - MIN(Total)
    FROM TotalOrdersUSA
    ''',
    con,
)

   MAX(Total) - MIN(Total)
0                  7638.45

9. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –∑–∞–∫–∞–∑–æ–≤ —É –∫–∞–∂–¥–æ–≥–æ –∏—Ö —Ç—Ä–µ—Ö —Å–∞–º—ã—Ö –º–æ–ª–æ–¥—ã—Ö —Å–æ—Ç—Ä—É–¥–Ω–∏–∫–æ–≤, –∞ —Ç–∞–∫–∂–µ –∏–º—è –∏ —Ñ–∞–º–∏–ª–∏—é –≤–æ –≤—Ç–æ—Ä–æ–π –∫–æ–ª–æ–Ω–∫–µ.

In [15]:
tasks+=1
pd.read_sql(
    '''
    WITH ImprovedEmployees AS (
        SELECT EmployeeID,  
                substr(BirthDate, 7) || '-' || substr(BirthDate, 4, 2) || '-' || substr(BirthDate, 1, 2) as DateBirth
        FROM Employees
        ORDER BY DateBirth DESC
        LIMIT 3)
    
    SELECT COUNT() as QuantityOrders, FirstName || ' ' || LastName as FirstLastName
    FROM Orders
    JOIN Employees
    ON Orders.EmployeeID = Employees.EmployeeID
    WHERE Employees.EmployeeID IN 
        (SELECT EmployeeID
         FROM ImprovedEmployees
        )
    GROUP BY Employees.EmployeeID
    ORDER BY QuantityOrders DESC
    ''',
    con,
)

   QuantityOrders    FirstLastName
0              31  Janet Leverling
1              29    Nancy Davolio
2               6   Anne Dodsworth

10. –°–∫–æ–ª—å–∫–æ –±–∞–Ω–æ–∫ –∫—Ä–∞–±–æ–≤–æ–≥–æ –º—è—Å–∞ –≤—Å–µ–≥–æ –±—ã–ª–æ –∑–∞–∫–∞–∑–∞–Ω–æ.

In [16]:
tasks+=1
pd.read_sql(
    '''
    SELECT ProductName, SUM(Quantity) 
    FROM OrderDetails
    JOIN Products
    on OrderDetails.ProductID = Products.ProductID
    WHERE ProductName = 'Boston Crab Meat'
    ''',
    con,
)

        ProductName  SUM(Quantity)
0  Boston Crab Meat            256

In [17]:
if tasks==10:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è üôÇ')
else:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –Ω–µ –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è! üôÄ')

–í—ã–ø–æ–ª–Ω–µ–Ω—ã –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è üôÇ